Catalogs/упМобильныеУстройстваИТрекеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упМобильныеУстройстваИТрекеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМоделиТрекеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерSIMКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверСбораДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСервераСбораДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упДатчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упДатчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНазначенияДатчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упМоделиТрекеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упМоделиТрекеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипУстройства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипУстройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаетТекущуюСкорость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Датчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерДатчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Датчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДатчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КалибровочныйГрафик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКалибровочныеГрафики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/упОбработкаДанныхТерминаловПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура возвращает терминал.
//
// Параметры:
//  ИдентификаторУстройства - Строка - Код датчика.
//
// Возвращаемое значение:
//   СправочникСсылка.упМобильныеУстройстваИТрекеры - Ссылка на элемент.
//
Функция НайтиТерминал(ИдентификаторУстройства) Экспорт
	
	Возврат Справочники.упМобильныеУстройстваИТрекеры.НайтиПоРеквизиту("ИдентификаторУстройства", ИдентификаторУстройства);
	
КонецФункции

// Процедура возвращает датчик.
//
// Параметры:
//  КодДатчика - Строка - Код датчика.
//	Модель - СправочникСсылка - Ссылка на элемент.
//	Представление - Строка - Представление датчика.
//
// Возвращаемое значение:
//   Структура - Результат выполнения.
//
Функция НайтиДатчик(КодДатчика, Модель, Представление = Неопределено) Экспорт
	
	п_КодДатчика = КодДатчика;
	Если ТипЗнч(КодДатчика)=ТИП("Число")Тогда
		п_КодДатчика = Формат(КодДатчика,"ЧРГ=' '; ЧН=0; ЧГ=0");
	ИначеЕсли НЕ ТипЗнч(КодДатчика)=ТИП("Строка")Тогда
		п_КодДатчика = СокрЛП(КодДатчика);
	КонецЕсли;
	
	Результат = Новый Структура("Датчик, КалибровочныйГрафик, Назначение", Справочники.упДатчики.ПустаяСсылка(), Справочники.упКалибровочныеГрафики.ПустаяСсылка(), Справочники.упНазначенияДатчиков.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упМоделиТрекеровДатчики.Датчик,
	|	упМоделиТрекеровДатчики.КалибровочныйГрафик,
	|	упМоделиТрекеровДатчики.Датчик.Назначение КАК Назначение,
	|	упМоделиТрекеровДатчики.НомерДатчика КАК Код
	|ИЗ
	|	Справочник.упМоделиТрекеров.Датчики КАК упМоделиТрекеровДатчики
	|ГДЕ
	|	упМоделиТрекеровДатчики.Ссылка = &Модель
	|	И упМоделиТрекеровДатчики.НомерДатчика = &КодДатчика
	|
	|УПОРЯДОЧИТЬ ПО
	|	упМоделиТрекеровДатчики.НомерСтроки";
	
	Запрос.УстановитьПараметр("КодДатчика",п_КодДатчика);	
	Запрос.УстановитьПараметр("Модель", Модель);
	
	ТаблицаДатчиков = Запрос.Выполнить().Выгрузить();
	ДатчикНайден = Ложь;
	Для каждого НастройкаДатчика Из ТаблицаДатчиков Цикл
		ТекущийКод = СокрЛП(НастройкаДатчика.Код);
		Если ТекущийКод = п_КодДатчика Тогда 
			ЗаполнитьЗначенияСвойств(Результат,НастройкаДатчика);
			ДатчикНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ДатчикНайден Тогда 
		НовДатчик = Справочники.упДатчики.СоздатьЭлемент();
		Если Представление = Неопределено Тогда
			НовДатчик.Наименование = КодДатчика;
		Иначе
			НовДатчик.Наименование = Представление;
		КонецЕсли;
		
		НовДатчик.Записать();
		Датчик = НовДатчик.Ссылка;
		
		спрОбъектМодель = Модель.ПолучитьОбъект();
		стрТЧ = спрОбъектМодель.Датчики.Добавить();
		стрТЧ.НомерДатчика = КодДатчика;
		стрТЧ.Датчик = Датчик;
		спрОбъектМодель.Записать();
		
		Результат.Датчик = Датчик;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
